In [ ]:
import pandas as pd
df1=pd.read_csv('各鄉鎮市區人口密度.csv')
df1.info()

In [ ]:
df1

In [3]:
#整理欄位,index資料->reindex()
#reindex(),在Series的使用方法
s1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
s1.reindex(index=['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [5]:
s1.reindex(index=['a','b'])

a   -5.3
b    7.2
dtype: float64

In [6]:
import numpy as np
df1=pd.DataFrame(np.arange(9).reshape(3,3),
index=['a', 'c', 'd'],
columns=['台北', '台中', '高雄'])
df1

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [7]:
df1.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [8]:
df1.reindex(index=['a', 'c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [9]:
df1.reindex(index=['a', 'c'],columns=['台北','台中'])

   台北  台中
a   0   1
c   3   4

In [10]:
#series
s1=pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [11]:
s1.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [12]:
s1.drop(['a','c'])

b    1.0
d    3.0
e    4.0
dtype: float64

In [15]:
#dataframe
df1=pd.DataFrame(np.arange(16.).reshape(4,4),
                 index=['台北','台中', '台南', '高雄'],
                 columns=['one', 'two', 'three', 'four'])
df1

     one   two  three  four
台北   0.0   1.0    2.0   3.0
台中   4.0   5.0    6.0   7.0
台南   8.0   9.0   10.0  11.0
高雄  12.0  13.0   14.0  15.0

In [16]:
df1.drop(['one','two'],axis=1)

    three  four
台北    2.0   3.0
台中    6.0   7.0
台南   10.0  11.0
高雄   14.0  15.0

In [17]:
df1.drop(['台北','台中'])

     one   two  three  four
台南   8.0   9.0   10.0  11.0
高雄  12.0  13.0   14.0  15.0

In [18]:
df1.drop(columns=['one','two'])

    three  four
台北    2.0   3.0
台中    6.0   7.0
台南   10.0  11.0
高雄   14.0  15.0

In [19]:
df1.drop(index=['台北','台中'])

     one   two  three  four
台南   8.0   9.0   10.0  11.0
高雄  12.0  13.0   14.0  15.0